Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-19-25.tmx
Source language: bo
Languages: en

source: །སེམས་ཅན་ཁྱིམ་གྱི་ནང་ན་གནས་པ་གང་གིས་སྤོས་ཀྱི་སྤྲིན་གྱི་དྲ་བ་དེ་ལ་རླུང་གིས་མ་དད་པའི་དྲི་ཚོར་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཞག་བདུན་དུ་དགའ་བ་དང་། མོས་པ་ཆེན་པོས་ཡོངས་སུ་རྒྱས་པར་འགྱུར་ཏེ། ལུས་དང་སེམས་ལ་བདེ་བ་དང་དགའ་བ་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་མྱོང་བར་འགྱུར་རོ། །དེ་དག་གི་ལས་ལ་ཡང་ཁམས་འཁྲུག་པ་ལ་ས་གྱུར་པའམ། གཞན་གྱིས་གནོད་པར་བྱ་བ་ལས་གྱུར་པའི་ནད་ཀྱང་འབྱུང་བར་འགྱུར་བ་མེད་དོ།
en: Those beings who are indoors and smell the scent that is brought in by the breeze from that net of clouds of perfume will all have increased happiness and aspiration for seven days and will experience various kinds of mental and physical happiness and pleasure, and they will have no illness that is caused by the disturbance of the elements in their bodies or is the result of harm caused by others.

source: །སེམས་ཀྱི་སྡུག་བསྔལ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་མི་འབྱུང་ངོ་།
en: They will have no suffering or unhappiness.

source: །འཇིགས་པའམ། སྡང་བའམ་བག་ཚ་བའམ། ཡིད་འཁྲུག་པ་འམ། གནོད་སེམས་ཀྱང་མི་རྒྱུ་སྟེ།
en: They will have no fear, no terror, no apprehension, no disturbance of mind, and no malice.

source: དེ་དག་ཐམས་ཅད་ཞག་བདུན་དུ་དགའ་བ་དང་བདེ་བ་སྐྱེས་ཏེ། གཅིག་ལ་གཅིག་བྱམས་པའི་སེམས་སུ་འགྱུར་རོ།
en: For seven days there will arise happiness and joy, and they will be kind to one another.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་དག་དེ་ལྟར་དགའ་བ་དང་། ཉམས་བདེ་བ་སྐྱེས་པ་རྣམས་ལ་བསམ་པ་དག་པར་བྱ་བའི་ཕྱིར་ཅི་ནས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: “Noble one, in order to purify the thoughts of those who are experiencing happiness and joy, I teach them the Dharma so that they will definitely have the highest, complete enlightenment.

source: །གཞན་ཡང་རིགས་ཀྱི་བུ་རི་མ་ལ་ཡ་ལས་འབྱུང་བའི་ཙན་དན་ས་སྟེང་ས་དམ་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Moreover, noble one, there is sandalwood called gośīrṣa that comes from the Malaya mountains.

source: དེ་ལུས་ལ་བསྐུས་ན་མེའི་འོབས་སུ་མཆོངས་ཀྱང་ཚིག་པ་མེད་དོ།
en: If you rub it on your body, you can jump into a great fire and you will not be burned.

source: རིགས་ཀྱི་བུ་རྒྱ་མཚོའི་མཐའ་ནས་འབྱུང་བའི་སྤོས་གཞན་གྱིས་ཐུབ་པ་མེད་པ་ཞེས་བ་ཡོད་དེ།
en: “Noble one, there is a perfume called invincible that comes from the ends of the ocean.

source: དེ་རྔའམ་དུང་ལ་བསྐུས་ན་དེའི་སྒྲས་གཞན་གྱི་འཁོར་ཐམས་ཅད་ཕམ་པར་འགྱུར་རོ།
en: If you rub it on a drum or a horn, its sound will defeat all the followers of others.

source: །རིགས་ཀྱི་བུ་མཚོ་མ་དྲོས་པའི་ངོགས་ནས་འབྱུང་བའི་ཨ་ག་རུ་ནག་པོ་པད་མོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is the black agarwood called lotus essence that comes from Lake Anavatapta

source: དེའི་རི་ལུ་ཏིལ་གྱི་འབྲུ་ཙམ་གཅིག་གི་དྲིས་ཀྱང་འཛམ་བུའི་གླིང་ཐམས་ཅད་རྒྱས་པར་གང་བར་འགྱུར་ཏེ།
en: The smell from a pellet the size of a sesame seed will fill all of Jambudvīpa.

source: སེམས་ཅན་གང་གིས་སྤོས་ཀྱི་དྲི་དེ་ཚོར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་སྡིག་པ་ལ་སྨོད་ཅིང་སྡོམ་པའི་སེམས་རབ་ཏུ་ཐོབ་བར་འགྱུར་རོ།
en: Every being that smells that perfume will renounce bad actions and gain a controlled mind.

source: །རིགས་ཀྱི་བུ་རིའི་རྒྱལ་པོ་ཁ་བ་ཅན་ལས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པ་འོད་དང་ལྡན་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called luminescent that comes from the Himalaya, the king of mountains.

source: དེའི་དྲི་ཚོར་ན་སེམས་ཅན་དེ་དག་འདོད་ཆགས་དང་བྲལ་བའི་སེམས་སུ་འགྱུར་ཏེ།
en: If one smells its scent, the mind will become freed from desire.

source: ཁོ་བོ་ནི་དེ་དག་ལ་ཅི་ནས་ཀྱང་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: I teach them the Dharma so that they will attain the samādhi called the stainless field

source: །རིགས་ཀྱི་བུ་སྲིན་པོའི་འཇིག་རྟེན་ནས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པ་རྒྱ་མཚོའི་སྙིང་པོ་ཞེས་བྱ་བ་ཡོད་དོ། །དེ་ནི་འཁོར་ལོས་སྒྱུར་བའི་ལོངས་སྤྱོད་ཀྱི་དོན་དུ་འབྱུང་སྟེ།
en: “Noble one, there is a kind of perfume called the essence of the sea that comes from the land of the rākṣasas and has been produced for the enjoyment of a cakravartin king.

source: དེས་བདུགས་མ་ཐག་ཏུ་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོའི་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པ་ཡང་ནམ་མཁའི་དབྱིངས་ལ་གནས་སོ།
en: As soon as he is perfumed by it, the cakravartin’s fourfold army appears in the sky.

source: །རིགས་ཀྱི་བུ་ལྷའི་འཁོར་ཆོས་བཟང་པོ་ནས་འབྱུང་བའི་སྤོས་ཀྱི་རྣམ་པར་རྣམ་པར་འབྱེད་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called array of beauty that comes from Sudharma, the assembly hall of the devas.

source: དེས་བདུགས་མ་ཐག་ཏུ་ལྷ་རྣམས་སངས་རྒྱས་ཀྱི་དྲི་ཞིམ་པོ་དྲན་པར་འགྱུར་རོ།
en: As soon as the devas are perfumed by it, they gain the memory of the pleasant aroma of the buddhas.

source: །རིགས་ཀྱི་བུ་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མའི་གནས་ན་སྤོས་ཀྱི་རྣམ་པ་དག་པའི་མཛོད་ཅེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called pure treasure in the paradise of Suyāma, the king of devas.

source: དེས་བདུག་མ་ཐག་ཏུ་མཚེ་མའི་ལྷའི་བུ་ཐམས་ཅད་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མའི་དྲུང་དུ་འདོང་ངོ་། །དེ་དག་དེར་ཕྱིན་ནས་ཀྱང་ལྷའི་རྒྱལ་པོ་རབ་མཚེ་མས་ཆོས་ཀྱི་གཏམ་བྱའོ།
en: As soon as they are perfumed by it, all Suyāma’s devas come before deva king Suyāma, and when they are in his presence, the deva king Suyāma talks to them about the Dharma.

source: །རིགས་ཀྱི་བུ་དགའ་ལྡན་གྱི་གནས་ན། སྤོས་ཀྱི་རྣམ་པ་སིན་དུ་བར་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called chaste tree in Tuṣita.

source: དེའི་སྤོས་ཀྱི་དུད་པ་བྱང་ཆུབ་སེམས་དཔའ་ཚེ་གཅིག་གིས་ཐོགས་པ་ཆོས་ཀྱི་སྟན་ལ་འདུག་པའི་མདུན་དུ་ཕྱུང་ན། སྤོས་ཀྱི་སྤྲིན་ཆེན་པོས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་གང་ཞིང་། དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པའི་ཆོས་ཀྱི་སྤྲིན་ཆེན་པོའི་ཆར་རབ་ཏུ་འབབ་བོ།
en: When its aroma reaches bodhisattvas with one life remaining and who are upon their Dharma seats, a great cloud of perfume fills the entire realm of phenomena, and from great Dharma clouds that have a variety of adornments a rain falls onto all the circles of followers of the tathāgatas.

source: །རིགས་ཀྱི་བུ་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའི་གནས་ན། སྤོས་ཀྱི་རྣམ་པ་ཡིད་འཕྲོག་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Noble one, there is a kind of perfume called captivating in the paradise of the deva king Sunirmita.

source: དེས་ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའི་གནས་སུ་བདུགས་ན། ཞག་བདུན་དུ་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བསམ་གྱིས་མི་ཁྱབ་པ་འབབ་པར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་སྤོས་སྦྱར་བ་དེ་ཤེས་སུ་ཟད་ན། ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་སྐྱོན་གྱི་དྲི་མ་མེད་པ་འདོད་པའི་འཇིག་རྟེན་ཐམས་ཅད་ནས་གྱེན་དུ་འཕགས་པ། ཉོན་མོངས་པའི་བདུད་ཀྱི་ཞགས་པ་དང་བྲལ་བ། སྲིད་པའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ། ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་དང་། གཟུགས་ཀྱིས་རྣམ་པར་སྤྱོད་པ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་གོས་པ་མེད་པ།
en: When there is that aroma in the paradise of the deva king Sunirmita, there falls an inconceivable rain from clouds of Dharma for seven days.

source: ཆགས་པ་མེད་པའི་ངང་ཚུལ་ཅན། སྒྲིབ་པ་མེད་པར་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་། ཡུལ་དུ་ལྡན་པ། ཀུན་གྱི་གཞིའི་གནས་ཐམས་ཅད་ལ་མི་གནས་པར། སྲིད་པའི་ཀུན་གཞི་དང་གནས་ཐམས་ཅད་དུ་རྒྱུ་བ་རྣམས་ཀྱི་སྤྱོད་པ་ཆེ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ།
en: “Noble one, I know how to combine perfumes, but how could I know the conduct or describe the qualities of those bodhisattvas who have no stain of faults and have transcended the entire realm of desire, who are free from the noose of the māra of the kleśas, who have transcended all the continuums of the states of existence, who perform conduct with bodies and the aspect of the illusion of wisdom, who are unstained by any world, who have the state of being without desire, who have the pure field of wisdom that is unobscured, who have the range and scope of unimpeded wisdom, who do not dwell in any basis or location, and who know the conduct of those who move in all the bases and locations of existence?

source: ཚུལ་ཁྲིམས་ཀྱི་སྤྱོད་པ་རྣམ་པར་དག་པའི་སྒོ་ཡོངས་སུ་སྨོས་པའམ།
en: How could I elucidate the gateway of their pure practice of correct conduct?

source: ཁ་ན་མ་ཐོ་བ་མེད་པའི་སྤྱོད་པ་བརྗོད་པའམ།
en: How could I describe their faultless conduct?

source: གནོད་པར་སྤྱོད་པ་མེད་པའི་ལུས་དང་ངག་དང་ཡིད་ཀྱི་རྒྱུད་བསྟན་པར་ནུས་རེ་སྐན།
en: How could I teach their continuum of body, speech, and mind that is devoid of harmful conduct? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན། གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region, there is a town named Kūṭāgāra

source: དེ་ན་མཉན་པ་དཔའ་བོ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་དྲུང་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས།
en: There dwells a mariner by the name of Vaira. Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུད་པ་ལའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། སྤོས་འཚོང་གི་ཚོང་དཔོན་ལོངས་སྤྱོད་ཨུཏ་པ་ལའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པར་འགྲོ་བའི་ལམ་དུ་འཇུག་པའི་ཚེ།
en: “Then Sudhana, the head merchant’s son, bowed his head to the feet of the perfume-seller head merchant Utpalabhūti, circumambulated the perfume-seller head merchant Utpalabhūti a hundred thousand times, keeping him to his right, and, looking back again and again, departed from the presence of the perfume-seller head merchant Utpalabhūti.

source: ལམ་གྱི་གྱེན་ཐུར་དང་། ལམ་མཉམ་པ་དང་། ལམ་གྱི་ཐག་ཐུག་དང་། ལམ་རྡུལ་ཡོད་པ་དང་། ལམ་རྡུལ་མེད་པ་དང་། ལམ་བདེ་བ་དང་། ལམ་མི་བདེ་བ་དང་། ལམ་དོག་པ་དང་། ལམ་བགེགས་མེད་པ་དང་། ལམ་འཁྱུག་པ་དང་། ལམ་འཁྱུག་པ་མེད་པ་ལ་རྣམ་པར་དཔྱད་དེ་བལྟས་ནས་འདི་སྙམ་དུ་བསམས་སོ། །འདི་ལྟར་བདག་དགེ་བའི་བཤེས་གཉེན་དེའི་དྲུང་དུ་འགྲོ་བ་འདི་ནི།
en: When Sudhana set out on the path to Kūṭāgāra , he observed and contemplated how the path could be upward or downward, even or uneven, dusty or free of dust, safe or hazardous, difficult or unobstructed, and crooked or straight.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་ནན་ཏན་གྱི་རྒྱུར་འགྱུར་རོ། །ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་གྱི་ནན་ཏན་གྱི་རྒྱུར་འགྱུར་རོ། །སེམས་ཅན་ལ་ཕན་གདགས་པའི་ལམ་གྱི་རྒྱུར་འགྱུར་རོ།
en: He thought, “This journey to a kalyāṇamitra will be a cause for the practice of the bodhisattva path, will be a cause of the practice of the path of the perfections, and will be a cause of the path of benefiting all beings, which will be a cause for turning all beings away from the precipice of attachment and aversion, of elation and depression; will be a cause for turning all beings away from a perception of inequality;

source: །སེམས་ཅན་ཐམས་ཅད་བྱམས་སྡང་དང་། མཐོན་དམན་དུ་གྱུར་བའི་གཡང་ས་ལས་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་མི་མཉམ་པའི་ནན་ཏན་ལས་བསྒྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པའི་རྡུལ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་དགེ་བའི་ལྟ་བ་སྣ་ཚོགས་ཀྱི་སྡོང་དུམ་དང་། ཚེར་མ་དང་། གྱོ་མོ་དང་གསེག་མ་བསྩལ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་བསྒྲིབས་པ་མེད་པ་ལ་གཞོལ་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཕོ་བྲང་དུ་ཐོགས་པ་མེད་པར་བསྐྱལ་བའི་རྒྱུར་འགྱུར་རོ།
en: will be a cause for removing the dust of the kleśas from all beings; will be a cause for clearing away the tree trunks, thorns, pebbles, and gravel of the various bad views of all beings; and, through their entering the unobscured realm of the Dharma, will be a cause for bringing them without hindrance to the palace of omniscience.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why is that?

source: དགེ་བའི་བཤེས་གཉེན་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སོ།
en: Because the kalyāṇamitras are the source of all good Dharmas, and the attainment of omniscience is dependent on the kalyāṇamitras.”

source: །དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རག་ལུས་སོ་ཞེས་དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པས་སྤྱོད་པ་ཐུབ་པར་དཀའ་བ་དེ་མཐར་གྱིས་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་དེར་ཕྱིན་ནས་མཉན་པ་དཔའ་བོ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས་གྲོང་ཁྱེར་ཆེན་པོ་ཞིག་གི་སྒོ་རྒྱ་མཚོ་ཆེན་པོའི་ངོགས་ན།
en: With his mind focused on those thoughts, and undergoing a difficult journey, he eventually arrived at the city of Kūṭāgāra . He looked and searched for the mariner Vaira and saw him at the shore of the ocean in front of the gate of the great city.

source: མཉན་པ་དཔའ་བོ་དེ་ཚོང་པ་བརྒྱ་ཕྲག་སྟོང་ཙམ་དང་། སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་གཏམ་སྣ་ཚོགས་མཉན་པར་འདོད་པ་ཤ་སྟག་གིས་ཀུན་ནས་བསྐོར་ཅིང་།
en: He was encircled by a hundred thousand merchants and many hundreds of thousands of people who all wished to listen to his various tales.

source: རྒྱ་མཚོའི་གཏམ་ཡོངས་སུ་བརྗོད་པས། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་སེམས་ཅན་རྣམས་ལ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་།
en: As he told them tales of the sea, he was teaching the beings about the ocean of qualities of the buddhas.

source: །མཐོང་ནས་ཀྱང་མཉན་པ་དཔའ་བོ་གང་ན་བ་དེར་སོང་སྟེ།
en: When Sudhana saw the mariner Vaira, he approached him.

source: ཕྱིན་ནས་མཉན་པ་དཔའ་བོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཉན་པ་དཔའ་བོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཉན་པ་དཔའ་བོའི་མདུན་དུ་འདུག་སྟེ།
en: Having approached him, Sudhana bowed his head to the mariner Vaira’s feet, circumambulated the mariner Vaira many hundreds of thousands of times, and sat down before the mariner Vaira.

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་བདག་གིས་ཐོས་ན།
en: Ārya, I have heard that you give instruction and teachings to bodhisattvas!

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། ཡེ་ཤེས་ཆེན་པོ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་འདྲི་བ་དང་། འཁོར་བའི་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱི་རྒྱུད་འགྱུར་བའི་རྒྱུ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གླིང་གི་གནས་སུ་འགྲོ་བ་འབྱུང་བའི་རྒྱུ་དང་། དབྱེར་མེད་པའི་ཐེག་པ་ཆེན་པོ་འབྱུང་བའི་རྒྱུ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བས་འཇིགས་པ་དང་འབྲལ་བར་འགྱུར་བའི་ལམ་གྱི་ནན་ཏན་འབྱུང་བའི་རྒྱུ་དང་། ཞི་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། རྒྱུད་སྣ་ཚོགས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ལམ་འབྱུང་བའི་རྒྱུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དུ་འགྲོ་བས་རྣམ་པར་སྤྱོད་པའི་སྨོན་ལམ་གྱི་ཤིང་རྟའི་འཁོར་ལོ་ཐོགས་པ་མེད་པའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་གཟི་བརྗིད་ཀྱི་དབའ་རླབས་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། ཚུལ་གྱི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། ཆོས་ཀྱི་ཕྱོགས་དང་། སྒོ་ཐམས་ཅད་ཀྱི་ཕྱི་མའི་མཐའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། ཐམས་ཅད་མཁྱེན་པའི་རྒྱ་མཚོར་འཇུག་པའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་འདི་འདྲི་བ་ལེགས་སོ་ལེགས་སོ།
en: Vaira said, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment, that you have asked about the cause of great wisdom, the cause of the continuity of the various sufferings of saṃsāra, the cause of journeying to the island of omniscience, the cause of the indivisible Mahāyāna, the cause of the practice of the path that is free from the fear of falling down to the level of the śrāvakas and pratyeka­buddhas, the cause of the path of knowledge that comprehends engaging in the gateways of various samādhis of peace, the cause of the pure and unimpeded path of the wheels of the chariot of the aspiration to the practice of all-pervasive bodhisattva conduct, the cause of the pure path of the way that is the nature of the display of all the majestic waves of bodhisattva conduct, the cause of the pure ultimate path of all the aspects and gateways of the Dharma, and the cause that gives rise to the pure path for entering the ocean of omniscience.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་རྒྱ་མཚོའི་ངོགས་ཀྱི་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་འདི་ན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྙིང་རྗེ་ཆེན་པོའི་རྒྱལ་མཚན་ཡོངས་སུ་སྦྱོང་ཞིང་གནས་ཏེ།
en: “Noble one, I dwell at the city of Kūṭāgāra on the seashore, purifying the bodhisattva conduct called the banner of great compassion

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཕོངས་པ་རྣམས་མཐོང་ནས། དེ་དག་གི་དོན་དུ་དཀའ་བ་སྤྱོད་དེ། དེ་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: “Noble one, when I see destitute beings in Jambudvīpa, I undergo hardships for their sake, which means I will fulfill all their wishes.

source: །འཇིག་རྟེན་གྱི་ཟང་ཟིང་གིས་ཡོངས་སུ་བསྡུ་བར་བྱའོ།
en: I will collect worldly goods for them.

source: །ཆོས་ཀྱི་ལོངས་སྤྱོད་ཀྱིས་དེ་དག་ཡོངས་སུ་ཚིམ་པར་བྱའོ།
en: I will satisfy them with the enjoyment of the Dharma.

source: །དེ་དག་ལ་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་ལམ་མན་ངག་དུ་བསྟན་པར་བྱའོ།
en: I will teach them the instructions for the path of the accumulation of merit.

source: །ཡེ་ཤེས་ཀྱི་ཚོགས་རྣམ་པར་སྤེལ་བར་བྱའོ།
en: I will cause them to increase their accumulation of wisdom.

source: །དགེ་བའི་རྩ་བའི་སྟོབས་ཡོངས་སུ་སྤེལ་བར་བྱའོ།
en: I will increase the power of their roots of merit.

source: །བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པར་བྱའོ།
en: I will cause them to develop the aspiration for enlightenment.

source: །བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པར་བྱའོ།
en: I will purify their aspiration for enlightenment.

source: །སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཉེ་བར་བརྟན་པར་བྱའོ།
en: I will cause them to have the enduring strength of great compassion.

source: །འཁོར་བའི་སྡུག་བསྔལ་རྣམ་པར་ཞི་བར་བྱའོ།
en: I will cause the suffering of saṃsāra to cease.

source: །འཁོར་བའི་སྤྱོད་པས་ཡོངས་སུ་མི་སྐྱོ་བའི་སྟོབས་ཤིན་ཏུ་བརྟན་པར་བྱའོ།
en: I will cause them to have an enduring strength for tireless conduct in saṃsāra.

source: །སེམས་ཅན་རྒྱ་མཚོ་བསྡུ་བ་ལ་འདི་དག་སྦྱར་བར་བྱའོ།
en: I will provide these to the gathering of an ocean of beings.

source: །ཡོན་ཏན་རྒྱ་མཚོའི་ནན་ཏན་གྱི་སྒོ་ལ་དགོད་པར་བྱའོ།
en: I will bring them into the gateways of the practice of an ocean of qualities.

source: །འདི་དག་ལ་ཆོས་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བ་ཉེ་བར་བསྒྲུབ་པར་བྱའོ།
en: I will cause them to obtain the light of the wisdom of the ocean of the Dharma.

source: །སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་འདི་དག་གིས་མངོན་པར་མཐོང་བར་བྱའོ།
en: I will cause them to see the entire ocean of buddhas.

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོ་ལ་ཡང་འདི་དག་གཟུད་པར་བྱའོ་ཞེས་དེ་ལྟ་བུའི་བསམ་པ་དང་། ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་ཁོ་བོས་རྒྱ་མཚོའི་ངོགས་ཀྱི་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་འདི་ན་གནས་སོ།
en: I will cause them to enter the ocean of omniscience. “Noble one, it is with such an aspiration and intention that I dwell in the city of Kūṭāgāra on the seashore.

source: །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་ལྟར་འགྲོ་བ་ལ་ཕན་པ་དང་། བདེ་བར་བརྩོན་པས་རྒྱ་མཚོ་ཆེན་པོའི་རིན་པོ་ཆེའི་གླིང་ཐམས་ཅད་ཀྱང་ཤེས་སོ།
en: “Noble one, dedicated in that way to the benefit and happiness of beings, I know all the islands of jewels in the great ocean.

source: །རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་དང་། །རིན་པོ་ཆེའི་རིགས་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་གཏོས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: I know all the jewel mines, all the classes of jewels, and all the sources of jewels.

source: །ཀླུའི་གནས་ཐམས་ཅད་དང་། ཀླུའི་འཁྲུག་པ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་འཁྲུག་པ་ཐམས་ཅད་དང་། སྲིན་པོའི་གནས་ཐམས་ཅད་དང་། སྲིན་པོའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། འབྱུང་པོའི་གནས་ཐམས་ཅད་དང་། འབྱུང་པོའི་བར་ཆད་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: “I know all the residences of the nāgas, all that disconcerts the nāgas, all the residences of the yakṣas, all that disconcerts the yakṣas, all the residences of the rākṣasas, all that allays fear of the rākṣasas, all the residences of the bhūtas, all that allays fear of the bhūtas, and all that eliminates the obstacles created by the bhūtas.

source: གློང་ཡོད་པ་ཐམས་ཅད་གློང་ཐམས་ཅད་བཀོལ་བ་དང་དབའ་རླབས་ཆེན་པོ་ཡོངས་སུ་སྤང་བ་དང་། ཆུའི་ཁ་དོག་རྣམ་པ་ཐ་དད་པའང་རབ་ཏུ་ཤེས་སོ།
en: “I know all whirlpools, the avoidance of whirlpools, and the avoidance of great waves.

source: །གཉི་ཟླ་དང་གཟའ་སྐར་གྱི་ཚོགས་ཡོངས་སུ་འཁོར་བ་དང་། ཉིན་ཞག་དང་སྐད་ཅིག་དང་། ཡུད་ཙམ་དང་ཐག་ཅིག་ཀྱང་རབ་ཏུ་ཤེས་སོ།
en: “I know the orbits of the sun, moon, planets, and constellations and the seconds, minutes, and hours of the days and nights.

source: །ཕན་ཚུན་དུ་འགྲོ་བའི་ཤོལ་འདུམས་དང་། བདེ་མི་བདེ་དང་། གྲུའི་འཁྲུལ་འཁོར་བརྟན་པར་བྱ་བ་དང་། གྲུ་བཟུར་བ་དང་། གྲུ་ཕུལ་བ་དང་། རླུང་བརྔོ་བ་དང་རླུང་བསྐྱེད་པ་དང་། གྲུ་བསྒྱུར་ཞིང་བཟློག་པ་དང་། གྲུ་བརྟོད་པ་དང་། གྲུ་བཏང་བ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: “I know the particular times to depart and arrive, safety and danger, whether a ship’s rigging is reliable, what ships to reject, what ships to sail, how to catch the winds, the coming of the wind, how to turn a ship, how to turn a ship around, how to anchor a ship, and how to launch a ship.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་ཤེས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་རྟག་ཏུ་སེམས་ཅན་གྱི་དོན་དང་དགོས་པ་བྱེད་དེ།
en: “Noble one, with that kind of knowledge I am constantly dedicated to necessary benefits for beings:

source: ཚོང་པའི་ཚོགས་གྲུ་བརྟན་པོས་ལམ་བདེ་ཞིང་ཉེ་ཞོར་མི་འགྱུར་ལ་མི་འཇིགས་པ་ནས། ཆོས་ཀྱི་གཏམ་གྱིས་དགའ་བ་དང་། སྤྲོ་བ་བསྐྱེད་ཅིང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་བྱས་ནས།
en: I bring a group of merchants, just as they wish, to the island of jewels safely, peacefully, without fear, and in a reliable ship, and I talk to them about the Dharma in a way that delights them and brings them joy.

source: དེ་དག་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཚོགས་ཏེ།
en: When they have collected all the jewels and have attained good fortune, I bring them back again to Jambudvīpa.

source: ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དང་། ཕྱིར་ཡང་འཛམ་བུའི་གླིང་དུ་འགྱེད་འགྱེད་ཀྱང་རིགས་ཀྱི་བུ་ཁོ་བོའི་གྲུ་ནི་ནམ་ཡང་བུབ་པའམ། ཉེ་ཞོར་གྱུར་མ་མྱོང་སྟེ། སེམས་ཅན་གང་གིས་ཁོ་བོ་མཐོང་བར་གྱུར་པ་དང་། སེམས་ཅན་གང་གིས་ཁོ་བོའི་ཆོས་བསྟན་པ་ཐོས་པ་དེ་དག་ཀྱང་འཁོར་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཉེ་ཞོར་འགྱུར་བའི་འཇིགས་པ་དང་བྲལ་བར་འགྱུར་རོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོར་འཇུག་པའི་ཡེ་ཤེས་ཀྱང་མངོན་སུམ་དུ་འགྱུར་རོ།
en: “Noble one, no ship of mine has ever been in distress. Any being who sees me and any being who hears me teach the Dharma becomes free from all fear of sinking in the ocean of saṃsāra, and they turn toward the wisdom of entering the ocean of omniscience.

source: །སྲེད་པའི་རྒྱ་མཚོ་བསྐམ་པའི་དོན་དུའང་རབ་ཏུ་འཇུག་པར་འགྱུར་ཏེ། དུས་གསུམ་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བའང་རབ་ཏུ་ཐོབ་བོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྒྱ་མཚོ་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མངོན་པར་མོས་པར་འགྱུར་རོ།
en: They become dedicated to drying up the ocean of craving, attain the light of the knowledge of the ocean of the three times, and make the aspiration to eliminate the ocean of the suffering of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོའི་རྙོག་པ་དང་བར་བྱ་བའི་ཕྱིར་ཡང་རབ་ཏུ་བརྩོན་པར་འགྱུར་རོ།
en: They become dedicated to purifying away the pollution in the ocean of the minds of all beings.

source: །ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཡང་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར་རོ།
en: They become dedicated to purifying the ocean of all realms.

source: །ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་གང་བ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ།
en: They never turn back from spreading throughout the ocean of all directions.

source: །འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཐ་དད་པའང་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ།
en: They comprehend the ocean of the different capabilities of all beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོའི་རྗེས་སུའང་འབྲང་བར་འགྱུར་རོ།
en: They follow the ocean of the conducts of all beings.

source: །འགྲོ་བའི་བསམ་པ་རྒྱ་མཚོ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་གཟུགས་བརྙན་འབྱུང་བར་འགྱུར་རོ།
en: They manifest appearances that accord with the ocean of the wishes of all beings.
